# Ззадача 3. Напишите программу, которая принимает на вход координаты 
# точки (X и Y), причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости, 
# в которой находится эта точка (или на какой оси она находится).
# *Пример:*
# - x=34; y=-30 -> 4
# - x=2; y=4-> 1
# - x=-34; y=-30 -> 3

def whatplane(msg):
     if x == 0 and y == 0:
          msg = "X и Y не могут быть равны нулю одновременно"
     else:
        if x>0 and y>0:
            msg = "1"
        elif x<0 and y>0:
            msg = "2"
        elif x<0 and y<0:
            msg = "3"
        elif x>0 and y<0:
            msg = "4"
        elif x == 0:
            msg = "Ось X"
        elif y == 0:
            msg = "Ось Y"
        return msg

msg = "Некорректный ввод!"
print("Введите X и Y, они не могут быть равны нулю одновременно")    
try:
    x = int(input("Введите координату x: "))
    y = int(input("Введите координату y: "))
    msg = whatplane(msg)
except:
    pass
finally: 
    print(msg)
